<!-- dflook/terraform-github-actions {"workspace":"pr_comment_approved","backend":"919f9bd7055638172fbdae1f550706d179963c7ea165d2afa64b9f3a5a1719d5","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #232 at https://github.com/dflook/terraform-github-actions/actions/runs/2810290674","plan_hash":"00d91a4440a631e59e20f1c02f74f4ce8b1cefe87d70485397af3ec52ec53808"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __pr_comment_approved__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "v3ouT5y0z7" -> (known after apply)
  ~ foreach = "4FbGr55Hnf" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #232](https://github.com/dflook/terraform-github-actions/actions/runs/2810290674)